Autodesk.Revit.DB.PrintManager.Apply
Apply the local print settings to global for all documents.
Remarks:
This method will change the settings for the current printer to match what is set in the
Print Manager. When the user attempts to print with this printer in the future, the changes
made by the API session will be visible.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this operation is not allowed in the current application mode,
or the print resource is occupied by others.

Autodesk.Revit.DB.PrintManager.SubmitPrint(Autodesk.Revit.DB.View)
Print a view with the current PrintManager settings.
view: The User-assigned view.
Returns: True if successful, otherwise False.
Remarks:
PrintManager will apply the local settings to global and print the user-assigned view with the current settings.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this operation is not allowed in the current application mode,
or the print resource is occupied by others.

Autodesk.Revit.DB.PrintManager.SubmitPrint
Print with the current PrintManager settings.
Print the views and sheets defined in the current local PrintManager settings.
Returns: True if successful, otherwise False.
Remarks:
PrintManager will apply the local settings to global and print the view/views/sheets which user defined with the current settings.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this operation is not allowed in the current application mode,
or the print resource is occupied by others.

Autodesk.Revit.DB.PrintManager.SelectNewPrintDriver(System.String)
Select a new printer.
strPrinterName: The name string of new printer.
Remarks:
This property is the global print setting property for all documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-strPrinterName-is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the assigned new printer is invalid,
or the print resource is occupied by others.

Autodesk.Revit.DB.PrintManager.PaperSources
Get all print sources of current printer.
Remarks: These are the valid paper source for the current printer.

Autodesk.Revit.DB.PrintManager.PaperSizes
Get all print sizes of current printer.
Remarks: These are the valid paper sizes for the current printer.

Autodesk.Revit.DB.PrintManager.IsVirtual
The virtual type in Autodesk Revit.

Autodesk.Revit.DB.PrintManager.Collate
Indicates whether to collate of the current print.
Remarks:
The value of this property represents the global print setting property used for print operations on any document.
In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which
save the local changes as modifications to the global print settings.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when there is only one view or only one copy in the current settings.

Autodesk.Revit.DB.PrintManager.PrintOrderReverse
Indicates whether to reverse the print order of the current print.
Remarks:
The value of this property represents the global print setting property used for print operations on any document.
In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which
save the local changes as modifications to the global print settings.

Autodesk.Revit.DB.PrintManager.CopyNumber
The copy number.
Remarks:
Returns 0 if current printer does not support CopyNumber property.
The value of this property represents the global print setting property used for print operations on any document.
In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which
save the local changes as modifications to the global print settings.

Autodesk.Revit.DB.PrintManager.PrintRange
The print range.
Remarks:
The value of this property represents the global print setting property used for print operations on any document.
In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which
save the local changes as modifications to the global print settings.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the argument is out of range.

Autodesk.Revit.DB.PrintManager.PrintToFileName
The file name when printing to file.
Remarks:
A default file name will be used when the PrintToFile is true and PrintToFileName is not be set.
The value of this property represents the global print setting property used for print operations on any document.
In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which
save the local changes as modifications to the global print settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input file name is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input file name is an invalid string.

Autodesk.Revit.DB.PrintManager.CombinedFile
Indicates whether to combine multiple selected views/sheets into a single file.
Remarks:
The value of this property represents the global print setting property used for print operations on any document.
In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which
save the local changes as modifications to the global print settings.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current printer is not a virtual printer.

Autodesk.Revit.DB.PrintManager.PrintToFile
Indicates whether to print to file.
Remarks:
The value of this property represents the global print setting property used for print operations on any document.
In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which
save the local changes as modifications to the global print settings.

Autodesk.Revit.DB.PrintManager.ViewSheetSetting
The ViewSheetSetting which manages the view/sheet set information of current document, and you can change the default view/sheet
set for current project.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the print range is not selected views/sheets.

Autodesk.Revit.DB.PrintManager.PrintSetup
The PrintSetup which manages the print settings of current document.
Remarks:
PrintSetup is an interface cluster just like File->Print->Settings->Setup or File->Print Setup in UI.

Autodesk.Revit.DB.PrintManager.PrinterName
The name of the current printer.

Autodesk.Revit.DB.PrintManager
The PrintManager object is used to configure the global print settings.
Remarks:
Global print settings include PrintToFile, CombinedFile, PrintToFileName, PrintRange, CopyNumber, PrintOrderReverse, Collate.
Once PrintManager is acquired from a document, changes of its global print setting properties are not automatically
applied toward the global print setting. Should the local setting be used, the user needs to call the Apply method.
If the user calls SubmitPrint methods, not only that printing will use the current state of properties of the (local) print manager,
but the setting will also be applied to the global settings.